{
  "projects": [
    {
      "name": "Maintenance Manatee",
      "description": "Organizing and keeping track of your vehicle(s)'s maintenance can be difficult and tedious. To address this problem, a group of collaborators and myself created the website Maintenance Manatee. It is a simple, concise application that allows users to create accounts, add vehicles to the account, and create posts detailing maintenance work done for the vehicle. This gives users the ability to not only track what maintenance work has been done, but also the cost of the work, when/where the work was done, and any other important details they may want to refer to. Maintenance Manatee was written and developed by four collaborators and utilizes JavaScript, Express.js, Handlebars.js, Tailwind CSS, and MySQL to store, manipulate, and display data. The app follows the MVC paradigm and is deployed using Heroku.",
      "methods": "The Maintenance Manatee follows the Model-View-Controller (MVC) paradigm. Models are defined for user accounts, vehicles, and posts using Sequelize and Connect-session-sequelize. User data is also stored using express-session. This gives the app a welcoming presentation by displaying custom headings and info for users once logged in to their account. The bcrypt package from Node.js is utilized to ensure that user passwords are protected within the database. The app's views are constructed of Handlebars templates with Tailwind CSS which easily and aesthetically renders data from the database. The responsive design of Maintenance Manatee means that the app looks great from any device while ensuring optimal functionality. Server routes stored in the controllers directory are created through the Express.js router. These routes are responsible for rendering pages as well as sending requests to the Maintenance Mantee's API for data manipulation. My main role throughout this project was to create and maintain all routes and models. However, I also contributed to the creation of client-side JavaScript, as well as formatting and styling using Tailwind CSS.",
      "skills": [
        "Collaborative Work", "Version Control", "Responsive Design", "MySQL", "JavaScript", "Handlebars", "MVC Paradigm", "Node.js", "Express.js", "Express-session", "bcrypt"
      ],
      "url": "https://maintenance-manatee-20230807-e071f072b462.herokuapp.com/",
      "github": "https://github.com/cdgonzo23/maintenance-manatee"
    },
    {
      "name": "Night-In Generator",
      "description": "add content",
      "skills": "add skills"
    },
    {
      "name": "Tech Blog",
      "description": "add content",
      "skills": "add skills"
    },
    {
      "name": "E-Commerce Backend",
      "description": "add content",
      "skills": "add skills"
    },
    {
      "name": "Professional README.md Generator",
      "description": "add content",
      "skills": "add skills"
    },
    {
      "name": "Weather Dashboard",
      "description": "add content",
      "skills": "add skills"
    }
  ]
}